namespace TestCodeFirst.Migrations
{
    using System;
    using System.Data.Entity.Migrations;
    
    public partial class AddManyToMany : DbMigration
    {
        public override void Up()
        {
            DropForeignKey("dbo.СправочникРесурсов", "ТехнологическоеУстройство_УстройствоId", "dbo.Устройство");
            DropIndex("dbo.СправочникРесурсов", new[] { "ТехнологическоеУстройство_УстройствоId" });
            CreateTable(
                "dbo.СправочникРесурсовТехнологическоеУстройство",
                c => new
                    {
                        СправочникРесурсов_Id = c.Int(nullable: false),
                        ТехнологическоеУстройство_УстройствоId = c.Int(nullable: false),
                    })
                .PrimaryKey(t => new { t.СправочникРесурсов_Id, t.ТехнологическоеУстройство_УстройствоId })
                .ForeignKey("dbo.СправочникРесурсов", t => t.СправочникРесурсов_Id, cascadeDelete: true)
                .ForeignKey("dbo.Устройство", t => t.ТехнологическоеУстройство_УстройствоId, cascadeDelete: true)
                .Index(t => t.СправочникРесурсов_Id)
                .Index(t => t.ТехнологическоеУстройство_УстройствоId);
            
            DropColumn("dbo.СправочникРесурсов", "ТехнологическоеУстройство_УстройствоId");
        }
        
        public override void Down()
        {
            AddColumn("dbo.СправочникРесурсов", "ТехнологическоеУстройство_УстройствоId", c => c.Int());
            DropForeignKey("dbo.СправочникРесурсовТехнологическоеУстройство", "ТехнологическоеУстройство_УстройствоId", "dbo.Устройство");
            DropForeignKey("dbo.СправочникРесурсовТехнологическоеУстройство", "СправочникРесурсов_Id", "dbo.СправочникРесурсов");
            DropIndex("dbo.СправочникРесурсовТехнологическоеУстройство", new[] { "ТехнологическоеУстройство_УстройствоId" });
            DropIndex("dbo.СправочникРесурсовТехнологическоеУстройство", new[] { "СправочникРесурсов_Id" });
            DropTable("dbo.СправочникРесурсовТехнологическоеУстройство");
            CreateIndex("dbo.СправочникРесурсов", "ТехнологическоеУстройство_УстройствоId");
            AddForeignKey("dbo.СправочникРесурсов", "ТехнологическоеУстройство_УстройствоId", "dbo.Устройство", "УстройствоId");
        }
    }
}
