namespace TestCodeFirst.Migrations
{
    using System;
    using System.Data.Entity.Migrations;
    
    public partial class SimpleUpdate19_01 : DbMigration
    {
        public override void Up()
        {
            AddColumn("dbo.ДневнаяНормаНаУстановку", "УстройствоРежимРесурс_РесурсId", c => c.Int());
            AddColumn("dbo.ДневнаяНормаНаУстановку", "УстройствоРежимРесурс_УстановкаId", c => c.Int());
            AddColumn("dbo.ДневнаяНормаНаУстановку", "УстройствоРежимРесурс_РежимРаботыУстановкиId", c => c.Int());
            CreateIndex("dbo.ДневнаяНормаНаУстановку", new[] { "УстройствоРежимРесурс_РесурсId", "УстройствоРежимРесурс_УстановкаId", "УстройствоРежимРесурс_РежимРаботыУстановкиId" });
            AddForeignKey("dbo.ДневнаяНормаНаУстановку", new[] { "УстройствоРежимРесурс_РесурсId", "УстройствоРежимРесурс_УстановкаId", "УстройствоРежимРесурс_РежимРаботыУстановкиId" }, "dbo.УстройствоРежимРесурс", new[] { "РесурсId", "УстановкаId", "РежимРаботыУстановкиId" });
            DropColumn("dbo.ДневнаяНормаНаУстановку", "РежимРаботыFK");
            DropColumn("dbo.ДневнаяНормаНаУстановку", "ТехнологическоеУстройствоFK");
        }
        
        public override void Down()
        {
            AddColumn("dbo.ДневнаяНормаНаУстановку", "ТехнологическоеУстройствоFK", c => c.Int(nullable: false));
            AddColumn("dbo.ДневнаяНормаНаУстановку", "РежимРаботыFK", c => c.Int(nullable: false));
            DropForeignKey("dbo.ДневнаяНормаНаУстановку", new[] { "УстройствоРежимРесурс_РесурсId", "УстройствоРежимРесурс_УстановкаId", "УстройствоРежимРесурс_РежимРаботыУстановкиId" }, "dbo.УстройствоРежимРесурс");
            DropIndex("dbo.ДневнаяНормаНаУстановку", new[] { "УстройствоРежимРесурс_РесурсId", "УстройствоРежимРесурс_УстановкаId", "УстройствоРежимРесурс_РежимРаботыУстановкиId" });
            DropColumn("dbo.ДневнаяНормаНаУстановку", "УстройствоРежимРесурс_РежимРаботыУстановкиId");
            DropColumn("dbo.ДневнаяНормаНаУстановку", "УстройствоРежимРесурс_УстановкаId");
            DropColumn("dbo.ДневнаяНормаНаУстановку", "УстройствоРежимРесурс_РесурсId");
        }
    }
}
