namespace TestCodeFirst.Migrations
{
    using System;
    using System.Data.Entity.Migrations;
    
    public partial class Modif : DbMigration
    {
        public override void Up()
        {
            DropForeignKey("dbo.УстановкаРежимРесурс", "РежимРаботыУстановкиId", "dbo.РежимРаботыУстановки");
            DropForeignKey("dbo.УстановкаРежимРесурс", "УстановкаId", "dbo.Установка");
            DropForeignKey("dbo.ДневнаяНормаНаУстановку", new[] { "УстройствоРежимРесурс_РесурсId", "УстройствоРежимРесурс_УстановкаId", "УстройствоРежимРесурс_РежимРаботыАгрегатаId", "УстройствоРежимРесурс_РежимРаботыУстановкиId" }, "dbo.УстановкаРежимРесурс");
            DropIndex("dbo.ДневнаяНормаНаУстановку", new[] { "УстройствоРежимРесурс_РесурсId", "УстройствоРежимРесурс_УстановкаId", "УстройствоРежимРесурс_РежимРаботыАгрегатаId", "УстройствоРежимРесурс_РежимРаботыУстановкиId" });
            DropIndex("dbo.УстановкаРежимРесурс", new[] { "УстановкаId" });
            DropIndex("dbo.УстановкаРежимРесурс", new[] { "РежимРаботыУстановкиId" });
            //DropPrimaryKey("dbo.УстановкаРежимРесурс");
            AddColumn("dbo.ДневнаяНормаНаУстановку", "ТехнологическаяУстановка_УстройствоId", c => c.Int());
            AddColumn("dbo.ДневнаяНормаНаУстановку", "РежимРаботыУстановки_Id", c => c.Int());
            //AddPrimaryKey("dbo.УстановкаРежимРесурс", new[] { "РесурсId", "РежимРаботыАгрегатаId" });
            CreateIndex("dbo.ДневнаяНормаНаУстановку", "ТехнологическаяУстановка_УстройствоId");
            CreateIndex("dbo.ДневнаяНормаНаУстановку", "РежимРаботыУстановки_Id");
            AddForeignKey("dbo.ДневнаяНормаНаУстановку", "ТехнологическаяУстановка_УстройствоId", "dbo.Установка", "УстройствоId");
            AddForeignKey("dbo.ДневнаяНормаНаУстановку", "РежимРаботыУстановки_Id", "dbo.РежимРаботыУстановки", "Id");
            DropColumn("dbo.ДневнаяНормаНаУстановку", "УстройствоРежимРесурс_РесурсId");
            DropColumn("dbo.ДневнаяНормаНаУстановку", "УстройствоРежимРесурс_УстановкаId");
            DropColumn("dbo.ДневнаяНормаНаУстановку", "УстройствоРежимРесурс_РежимРаботыАгрегатаId");
            DropColumn("dbo.ДневнаяНормаНаУстановку", "УстройствоРежимРесурс_РежимРаботыУстановкиId");
            //DropColumn("dbo.УстановкаРежимРесурс", "УстановкаId");
            //DropColumn("dbo.УстановкаРежимРесурс", "РежимРаботыУстановкиId");
        }
        
        public override void Down()
        {
            AddColumn("dbo.УстановкаРежимРесурс", "РежимРаботыУстановкиId", c => c.Int(nullable: false));
            AddColumn("dbo.УстановкаРежимРесурс", "УстановкаId", c => c.Int(nullable: false));
            AddColumn("dbo.ДневнаяНормаНаУстановку", "УстройствоРежимРесурс_РежимРаботыУстановкиId", c => c.Int());
            AddColumn("dbo.ДневнаяНормаНаУстановку", "УстройствоРежимРесурс_РежимРаботыАгрегатаId", c => c.Int());
            AddColumn("dbo.ДневнаяНормаНаУстановку", "УстройствоРежимРесурс_УстановкаId", c => c.Int());
            AddColumn("dbo.ДневнаяНормаНаУстановку", "УстройствоРежимРесурс_РесурсId", c => c.Int());
            DropForeignKey("dbo.ДневнаяНормаНаУстановку", "РежимРаботыУстановки_Id", "dbo.РежимРаботыУстановки");
            DropForeignKey("dbo.ДневнаяНормаНаУстановку", "ТехнологическаяУстановка_УстройствоId", "dbo.Установка");
            DropIndex("dbo.ДневнаяНормаНаУстановку", new[] { "РежимРаботыУстановки_Id" });
            DropIndex("dbo.ДневнаяНормаНаУстановку", new[] { "ТехнологическаяУстановка_УстройствоId" });
            //DropPrimaryKey("dbo.УстановкаРежимРесурс");
            DropColumn("dbo.ДневнаяНормаНаУстановку", "РежимРаботыУстановки_Id");
            DropColumn("dbo.ДневнаяНормаНаУстановку", "ТехнологическаяУстановка_УстройствоId");
            //AddPrimaryKey("dbo.УстановкаРежимРесурс", new[] { "РесурсId", "УстановкаId", "РежимРаботыАгрегатаId", "РежимРаботыУстановкиId" });
            //CreateIndex("dbo.УстановкаРежимРесурс", "РежимРаботыУстановкиId");
            //CreateIndex("dbo.УстановкаРежимРесурс", "УстановкаId");
            CreateIndex("dbo.ДневнаяНормаНаУстановку", new[] { "УстройствоРежимРесурс_РесурсId", "УстройствоРежимРесурс_УстановкаId", "УстройствоРежимРесурс_РежимРаботыАгрегатаId", "УстройствоРежимРесурс_РежимРаботыУстановкиId" });
            AddForeignKey("dbo.ДневнаяНормаНаУстановку", new[] { "УстройствоРежимРесурс_РесурсId", "УстройствоРежимРесурс_УстановкаId", "УстройствоРежимРесурс_РежимРаботыАгрегатаId", "УстройствоРежимРесурс_РежимРаботыУстановкиId" }, "dbo.УстановкаРежимРесурс", new[] { "РесурсId", "УстановкаId", "РежимРаботыАгрегатаId", "РежимРаботыУстановкиId" });
            AddForeignKey("dbo.УстановкаРежимРесурс", "УстановкаId", "dbo.Установка", "УстройствоId", cascadeDelete: true);
            AddForeignKey("dbo.УстановкаРежимРесурс", "РежимРаботыУстановкиId", "dbo.РежимРаботыУстановки", "Id", cascadeDelete: true);
        }
    }
}
