namespace TestCodeFirst.Migrations
{
    using System;
    using System.Data.Entity.Migrations;
    
    public partial class RenameTableManyToMany : DbMigration
    {
        public override void Up()
        {
            RenameTable(name: "dbo.УстройствоРежимРесурс", newName: "УстановкаРежимРесурс");
            DropForeignKey("dbo.ДневнаяНормаНаУстановку", new[] { "УстройствоРежимРесурс_РесурсId", "УстройствоРежимРесурс_УстановкаId", "УстройствоРежимРесурс_РежимРаботыАгрегатаId" }, "dbo.УстройствоРежимРесурс");
            DropIndex("dbo.ДневнаяНормаНаУстановку", new[] { "УстройствоРежимРесурс_РесурсId", "УстройствоРежимРесурс_УстановкаId", "УстройствоРежимРесурс_РежимРаботыАгрегатаId" });
            //DropPrimaryKey("dbo.УстановкаРежимРесурс");
            AddColumn("dbo.ДневнаяНормаНаУстановку", "УстройствоРежимРесурс_РежимРаботыУстановкиId", c => c.Int());
            //AddColumn("dbo.УстановкаРежимРесурс", "РежимРаботыУстановкиId", c => c.Int(nullable: false));
            //AddPrimaryKey("dbo.УстановкаРежимРесурс", new[] { "РесурсId", "УстановкаId", "РежимРаботыАгрегатаId", "РежимРаботыУстановкиId" });
            //CreateIndex("dbo.ДневнаяНормаНаУстановку", new[] { "УстройствоРежимРесурс_РесурсId", "УстройствоРежимРесурс_УстановкаId", "УстройствоРежимРесурс_РежимРаботыАгрегатаId", "УстройствоРежимРесурс_РежимРаботыУстановкиId" });
            //CreateIndex("dbo.УстановкаРежимРесурс", "РежимРаботыУстановкиId");
            //AddForeignKey("dbo.УстановкаРежимРесурс", "РежимРаботыУстановкиId", "dbo.РежимРаботыУстановки", "Id", cascadeDelete: true);
            //AddForeignKey("dbo.ДневнаяНормаНаУстановку", new[] { "УстройствоРежимРесурс_РесурсId", "УстройствоРежимРесурс_УстановкаId", "УстройствоРежимРесурс_РежимРаботыАгрегатаId", "УстройствоРежимРесурс_РежимРаботыУстановкиId" }, "dbo.УстановкаРежимРесурс", new[] { "РесурсId", "УстановкаId", "РежимРаботыАгрегатаId", "РежимРаботыУстановкиId" });
        }
        
        public override void Down()
        {
            DropForeignKey("dbo.ДневнаяНормаНаУстановку", new[] { "УстройствоРежимРесурс_РесурсId", "УстройствоРежимРесурс_УстановкаId", "УстройствоРежимРесурс_РежимРаботыАгрегатаId", "УстройствоРежимРесурс_РежимРаботыУстановкиId" }, "dbo.УстановкаРежимРесурс");
            DropForeignKey("dbo.УстановкаРежимРесурс", "РежимРаботыУстановкиId", "dbo.РежимРаботыУстановки");
            DropIndex("dbo.УстановкаРежимРесурс", new[] { "РежимРаботыУстановкиId" });
            DropIndex("dbo.ДневнаяНормаНаУстановку", new[] { "УстройствоРежимРесурс_РесурсId", "УстройствоРежимРесурс_УстановкаId", "УстройствоРежимРесурс_РежимРаботыАгрегатаId", "УстройствоРежимРесурс_РежимРаботыУстановкиId" });
            //DropPrimaryKey("dbo.УстановкаРежимРесурс");
            DropColumn("dbo.УстановкаРежимРесурс", "РежимРаботыУстановкиId");
            DropColumn("dbo.ДневнаяНормаНаУстановку", "УстройствоРежимРесурс_РежимРаботыУстановкиId");
            //AddPrimaryKey("dbo.УстановкаРежимРесурс", new[] { "РесурсId", "УстановкаId", "РежимРаботыАгрегатаId" });
            //CreateIndex("dbo.ДневнаяНормаНаУстановку", new[] { "УстройствоРежимРесурс_РесурсId", "УстройствоРежимРесурс_УстановкаId", "УстройствоРежимРесурс_РежимРаботыАгрегатаId" });
            //AddForeignKey("dbo.ДневнаяНормаНаУстановку", new[] { "УстройствоРежимРесурс_РесурсId", "УстройствоРежимРесурс_УстановкаId", "УстройствоРежимРесурс_РежимРаботыАгрегатаId" }, "dbo.УстройствоРежимРесурс", new[] { "РесурсId", "УстановкаId", "РежимРаботыАгрегатаId" });
            RenameTable(name: "dbo.УстановкаРежимРесурс", newName: "УстройствоРежимРесурс");
        }
    }
}
